app/controllers/tumors_controller.rb

SELECT "tumors".* FROM "tumors"
---
  def index
    @tumors = Tumor.all

INSERT INTO "tumors" ("abdominal", "axilar", "cerebro", "created_at", "cuello", "edad", "email", "genero", "grado_tumor", "higado", "hueso", "mediastino", "medula_osea", "name", "peritoneum", "piel", "pleura", "pulmon", "supraclavicular", "tipo_histologico", "tipo_tumor", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
---
  def create
    tp = tumor_params
    tp[:tipo_tumor], ad = tipo(tp)
    @tumor = Tumor.new(tp)

    respond_to do |format|
      if @tumor.save

UPDATE "tumors" SET "cuello" = $1, "edad" = $2, "grado_tumor" = $3, "tipo_histologico" = $4, "updated_at" = $5 WHERE "tumors"."id" = 4  [["cuello", "t"], ["edad", ">30"], ["grado_tumor", "bueno"], ["tipo_histologico", "adenoide"], ["updated_at", "2015-12-01 15:19:48.408621"]]
---
  def update
    tp = tumor_params
    tp[:tipo_tumor], ad = tipo(tp)
    respond_to do |format|
      if @tumor.update(tp)

DELETE FROM "tumors" WHERE "tumors"."id" = $1  [["id", 1]]
---
  def destroy
    @tumor.destroy

SELECT  "tumors".* FROM "tumors"  WHERE "tumors"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_tumor
      @tumor = Tumor.find(params[:id])